TestPlans/Car/Acorn Direct/xml/ACD3_25112014_3.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <Quote xmlns="http://TGSL/TES_Aggregator">
      <lxmlTGSLXML>
        <tgsl xmlns="http://www.transactorgsl.com/schemas">
          <aggregator>comparethemarket</aggregator>
          <domain>http://localhost</domain>
          <partner>
            <partnerName>acorn</partnerName>
            <broker>acorn</broker>
          </partner>
          <product>motor</product>
        </tgsl>
      </lxmlTGSLXML>
      <lstrRiskXML>
        <p:motorRisk xmlns:p="http://www.transactorgsl.com/schemas" xmlns="http://www.transactorgsl.com/schemas">
          <p:insuredParty instance="1">
            <p:accessToOtherVehicles>true</p:accessToOtherVehicles>
            <p:client>true</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>2012-03-01T00:00:00</p:dateLicenceObtained>
            <p:dob>1979-03-03T00:00:00</p:dob>
            <p:email>transformerPC03@emailreaction.org</p:email>
            <p:forename>Charlotte</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>E</p:licenceTypeID>
            <p:mainDriver>true</p:mainDriver>
            <p:maritalStatusID>C</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:numberOfVehiclesAccessTo>3</p:numberOfVehiclesAccessTo>
            <p:password>compareDM</p:password>
            <p:sex>Female</p:sex>
            <p:surname>Three</p:surname>
            <p:titleID>005</p:titleID>
            <p:ukResidenceYears>35</p:ukResidenceYears>
            <p:vehicleUseID>04</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:insuredParty instance="2">
            <p:accessToOtherVehicles>true</p:accessToOtherVehicles>
            <p:client>false</p:client>
            <p:clubMember>0</p:clubMember>
            <p:criminalOffence>false</p:criminalOffence>
            <p:dateLicenceObtained>2013-03-01T00:00:00</p:dateLicenceObtained>
            <p:dob>1978-08-06T00:00:00</p:dob>
            <p:email />
            <p:forename>Charles</p:forename>
            <p:homeOwner>true</p:homeOwner>
            <p:insurancePreviouslyRefused>false</p:insurancePreviouslyRefused>
            <p:licenceRestrictionsID>8</p:licenceRestrictionsID>
            <p:licenceTypeID>F</p:licenceTypeID>
            <p:mainDriver>false</p:mainDriver>
            <p:maritalStatusID>C</p:maritalStatusID>
            <p:mothersMaidenName />
            <p:relationshipID>W</p:relationshipID>
            <p:password>compareDM</p:password>
            <p:sex>Male</p:sex>
            <p:surname>Three</p:surname>
            <p:titleID>003</p:titleID>
            <p:ukResidenceYears>36</p:ukResidenceYears>
            <p:vehicleUseID>04</p:vehicleUseID>
            <p:numberOfOtherVehiclesOwned>0</p:numberOfOtherVehiclesOwned>
            <p:numberOfVehiclesInFamily>0</p:numberOfVehiclesInFamily>
          </p:insuredParty>
          <p:correspondanceAddress instance="1">
            <p:house>174</p:house>
            <p:street>Partington Lane</p:street>
            <p:locality />
            <p:city>Swinton</p:city>
            <p:county>Manchester</p:county>
            <p:country />
            <p:postcode>M27 0WN</p:postcode>
          </p:correspondanceAddress>
          <p:occupation instance="1" insuredPartyInstance="1">
            <p:employersBusinessID>054</p:employersBusinessID>
            <p:employmentStatusID>E</p:employmentStatusID>
            <p:occupationID>066</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:occupation instance="1" insuredPartyInstance="2">
            <p:employersBusinessID>186</p:employersBusinessID>
            <p:employmentStatusID>U</p:employmentStatusID>
            <p:occupationID>U03</p:occupationID>
            <p:parttime>false</p:parttime>
            <p:primaryOccupation>true</p:primaryOccupation>
          </p:occupation>
          <p:telephone instance="1">
            <p:telephoneNumber>01733345678</p:telephoneNumber>
            <p:telephoneTypeID>3AJPQ7C6</p:telephoneTypeID>
          </p:telephone>
          <p:claim instance="1" insuredPartyInstance="1">
            <p:atFault>true</p:atFault>
            <p:claimDetailsID>2</p:claimDetailsID>
            <p:claimStatusID>001</p:claimStatusID>
            <p:claimTypeID>A</p:claimTypeID>
            <p:dateOfClaim>2010-01-01T00:00:00</p:dateOfClaim>
            <p:injuryInvolved>false</p:injuryInvolved>
            <p:ncdAffected>false</p:ncdAffected>
            <p:totalCost>0.00</p:totalCost>
          </p:claim>
          <p:claim instance="2" insuredPartyInstance="2">
            <p:atFault>true</p:atFault>
            <p:claimDetailsID>1</p:claimDetailsID>
            <p:claimStatusID>001</p:claimStatusID>
            <p:claimTypeID>M</p:claimTypeID>
            <p:dateOfClaim>2011-10-01T00:00:00</p:dateOfClaim>
            <p:injuryInvolved>false</p:injuryInvolved>
            <p:ncdAffected>false</p:ncdAffected>
            <p:totalCost>500.00</p:totalCost>
          </p:claim>
          <p:cover instance="1">
            <p:coverRequiredID>01</p:coverRequiredID>
            <p:coverStartDate>2014-11-26T00:00:00</p:coverStartDate>
            <p:previousInsurance>false</p:previousInsurance>
            <p:voluntaryExcess>800</p:voluntaryExcess>
          </p:cover>
          <p:vehicle instance="1">
            <p:abiCode>31520102</p:abiCode>
            <p:annualMileage>4999</p:annualMileage>
            <p:bodyTypeID>01</p:bodyTypeID>
            <p:businessMileage>0</p:businessMileage>
            <p:currentMileage>0</p:currentMileage>
            <p:dateOfPurchase>2009-08-01T00:00:00</p:dateOfPurchase>
            <p:fuelTypeID>002</p:fuelTypeID>
            <p:gearboxTypeID>002</p:gearboxTypeID>
            <p:imported>false</p:imported>
            <p:increasedBHP>0</p:increasedBHP>
            <p:keeperID>7</p:keeperID>
            <p:kitCar>false</p:kitCar>
            <p:leftHandDrive>false</p:leftHandDrive>
            <p:modifiedWhilstOwned>true</p:modifiedWhilstOwned>
            <p:numberOfDoors>5</p:numberOfDoors>
            <p:numberOfSeats>3</p:numberOfSeats>
            <p:ownerID>7</p:ownerID>
            <p:overnightParkingID>4</p:overnightParkingID>
            <p:pricePaid>5000</p:pricePaid>
            <p:qPlated>false</p:qPlated>
            <p:registrationNumber>AK05VNH</p:registrationNumber>
            <p:usedForTrackDays>false</p:usedForTrackDays>
            <p:value>5000</p:value>
            <p:vehicleCC>1999</p:vehicleCC>
            <p:vehicleMake>Mazda</p:vehicleMake>
            <p:vehicleModel>3</p:vehicleModel>
            <p:yearOfManufacture>2005</p:yearOfManufacture>
          </p:vehicle>
          <p:ncd instance="1">
            <p:ncdYears>0</p:ncdYears>
            <p:protectedNCD>false</p:protectedNCD>
          </p:ncd>
          <p:garageAddress instance="1">
            <p:house>174</p:house>
            <p:street>Partington Lane</p:street>
            <p:locality />
            <p:city>Swinton</p:city>
            <p:county>Manchester</p:county>
            <p:country />
            <p:postcode>M27 0WN</p:postcode>
          </p:garageAddress>
          <p:modification instance="1">
            <p:forMedicalReasons>false</p:forMedicalReasons>
            <p:modificationID>18</p:modificationID>
            <p:value>0</p:value>
          </p:modification>
          <p:modification instance="2">
            <p:forMedicalReasons>false</p:forMedicalReasons>
            <p:modificationID>28</p:modificationID>
            <p:value>0</p:value>
          </p:modification>
          <p:modification instance="3">
            <p:forMedicalReasons>false</p:forMedicalReasons>
            <p:modificationID>27</p:modificationID>
            <p:value>0</p:value>
          </p:modification>
          <p:security instance="1">
            <p:dateFitted>2014-11-17T00:00:00</p:dateFitted>
            <p:fittedByID>4</p:fittedByID>
            <p:securityID>92</p:securityID>
          </p:security>
        </p:motorRisk>
      </lstrRiskXML>
    </Quote>
  </soap:Body>
</soap:Envelope>